<script setup>
import { ref, watch, nextTick } from "vue";
import SliderItem from "./sliderItem.vue";
import { RouterLink } from "vue-router";
import { useParametsSettingStore } from "@/stores/ParametsSetting.js";
let ParametsSetting = useParametsSettingStore();
import { useGlobalInformationStore } from "@/stores/GlobalInformation.js";
let GlobalInformation = useGlobalInformationStore();
import { useCurrentChatInfoStore } from "@/stores/CurrentChatInfo.js";
let { ChangeUUID } = useCurrentChatInfoStore();

// 这个组件的根元素
let BottomLeft = ref(null);
// 控制BottomLeft组件的高度
watch(
  () => ParametsSetting.BottomHeight,
  (newValue) => {
    nextTick(() => {
      if (ParametsSetting.w_phone) {
        BottomLeft.value.style.height = `100vh`;
      } else {
        BottomLeft.value.style.height = `${newValue}px`;
      }
    });
  },
  {
    immediate: true,
  }
);

// 通过UUID更改 某一个对话的title
const ChangeTitle = (uuid, title) => {
  GlobalInformation.ChangeChatTitleByUUID(uuid, title);
};

// 根据UUID  删除 某一个对话
const DeleteMsg = (uuid) => {
  GlobalInformation.DeleteChatByUUID(uuid);
};

// 点击面具和新建对话的回调
const IsCloseDrawer = () => {
  // 默认新建对话
  ChangeUUID("");
  // 如果 w_phone为真的话 还要把 el-drawer 关掉
  if (ParametsSetting.w_phone) {
    ParametsSetting.SliderBarDrawerFlag = false;
  }
};
</script>

<template>
  <!-- bg-violet-100 -->
  <div ref="BottomLeft" class="p-3 border-r rounded-bl bg-[#e7f8ff]">
    <!-- max-height="20px" -->
    <el-scrollbar>
      <div class="flex justify-evenly items-center gap-2 border-b-2 pb-2 mb-2">
        <!-- 面具 -->
        <RouterLink
          to="/maskplay"
          active-class="maskplayActive"
          @click="IsCloseDrawer"
          class="SliderItemTop">
          <div>
            <svg
              t="1707375433941"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="7607"
              width="24"
              height="24">
              <path
                d="M709.792 477.248c-21.568-49.408-70.304-73.92-108.864-54.72-38.528 19.2-52.288 74.816-30.72 124.224 21.568 49.408 70.304 73.92 108.864 54.72 38.528-19.2 52.288-74.816 30.72-124.224zM314.208 477.248c21.568-49.408 70.304-73.92 108.864-54.72 38.528 19.2 52.288 74.816 30.72 124.224-21.568 49.408-70.304 73.92-108.864 54.72-38.528-19.2-52.288-74.816-30.72-124.224z"
                fill="#53b1e2"
                p-id="7608"></path>
              <path
                d="M628.864 400c-12.32 0-24.128 2.752-35.04 8.224-46.016 22.912-63.168 87.904-38.304 144.96 18.784 43.008 56.32 70.816 95.616 70.816 12.32 0 24.128-2.752 35.04-8.224 46.016-22.912 63.168-87.904 38.304-144.96-18.784-43.008-56.32-70.816-95.616-70.816z m43.072 187.136a46.08 46.08 0 0 1-20.8 4.864c-26.144 0-52.8-20.736-66.272-51.648-18.208-41.632-7.776-88.064 23.2-103.488a46.08 46.08 0 0 1 20.8-4.864c26.144 0 52.8 20.736 66.272 51.648 18.208 41.632 7.776 88.064-23.2 103.488zM468.48 553.184c24.864-57.056 7.712-122.048-38.272-144.96a77.984 77.984 0 0 0-35.072-8.224c-39.296 0-76.8 27.84-95.584 70.816-24.896 57.056-7.744 122.048 38.24 144.96 10.944 5.44 22.752 8.224 35.072 8.224 39.296 0 76.8-27.84 95.584-70.816z m-116.416 33.92c-30.976-15.392-41.408-61.824-23.2-103.456 13.472-30.912 40.128-51.648 66.272-51.648 7.328 0 14.304 1.632 20.8 4.864 30.976 15.424 41.408 61.856 23.2 103.488-17.28 39.552-57.408 61.568-87.072 46.784z"
                fill="#53b1e2"
                p-id="7609"></path>
              <path
                d="M640 544m-32 0a32 32 0 1 0 64 0 32 32 0 1 0-64 0Z"
                fill="#53b1e2"
                p-id="7610"></path>
              <path
                d="M384 544m-32 0a32 32 0 1 0 64 0 32 32 0 1 0-64 0Z"
                fill="#53b1e2"
                p-id="7611"></path>
              <path
                d="M832 64c-54.4 0-106.272 23.552-142.464 63.584C635.616 107.168 575.776 96 512 96c-63.744 0-123.584 11.168-177.472 31.552A191.744 191.744 0 0 0 192 64C86.112 64 0 150.112 0 256c0 60.64 29.12 117.6 77.12 153.6A415.168 415.168 0 0 0 64 512c0 247.04 200.96 448 448 448s448-200.96 448-448c0-35.68-4.864-69.824-13.12-102.464A192.864 192.864 0 0 0 1024 256c0-105.888-86.112-192-192-192zM64 256c0-70.592 57.408-128 128-128 29.856 0 58.176 10.56 80.736 28.96-77.28 43.648-137.824 108.32-173.248 187.2A128.384 128.384 0 0 1 64 256z m448 640C300.256 896 128 723.744 128 512 128 308.032 289.504 160 512 160s384 148.032 384 352c0 211.744-172.256 384-384 384z m412.544-551.776c-35.456-78.944-96.032-143.68-173.344-187.296A128.48 128.48 0 0 1 832 128c70.592 0 128 57.408 128 128 0 33.12-13.12 64.64-35.456 88.224z"
                fill="#53b1e2"
                p-id="7612"></path>
              <path
                d="M623.232 669.888a16 16 0 0 0-15.264 16.704c0.896 20.928-11.616 39.456-30.464 45.024a46.624 46.624 0 0 1-44.736-11.392 81.376 81.376 0 0 1-6.528-7.52c-5.376-10.56-22.816-10.656-28.384-0.192-1.12 1.6-3.616 4.608-6.624 7.68-11.328 11.52-29.76 16.512-44.736 12.064-18.56-5.504-31.36-24.576-30.464-45.376a16 16 0 1 0-31.968-1.408c-1.568 35.84 20.352 67.712 53.344 77.44 6.592 1.984 13.504 2.912 20.48 2.912 19.616 0 39.584-7.552 54.112-21.184 19.36 18.112 48.96 25.248 74.592 17.664 32.96-9.76 54.88-41.472 53.344-77.12a15.936 15.936 0 0 0-16.704-15.296z"
                fill="#53b1e2"
                p-id="7613"></path>
            </svg>
          </div>
          <span>面具</span>
        </RouterLink>
        <!-- 新建对话  -->
        <RouterLink to="/chat" @click="IsCloseDrawer" class="SliderItemTop">
          <div>
            <svg
              t="1707044047323"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="4221"
              width="24"
              height="24">
              <path
                d="M853.333333 501.333333c-17.066667 0-32 14.933333-32 32v320c0 6.4-4.266667 10.666667-10.666666 10.666667H170.666667c-6.4 0-10.666667-4.266667-10.666667-10.666667V213.333333c0-6.4 4.266667-10.666667 10.666667-10.666666h320c17.066667 0 32-14.933333 32-32s-14.933333-32-32-32H170.666667c-40.533333 0-74.666667 34.133333-74.666667 74.666666v640c0 40.533333 34.133333 74.666667 74.666667 74.666667h640c40.533333 0 74.666667-34.133333 74.666666-74.666667V533.333333c0-17.066667-14.933333-32-32-32z"
                fill="#53b1e2"
                p-id="4222"></path>
              <path
                d="M405.333333 484.266667l-32 125.866666c-2.133333 10.666667 0 23.466667 8.533334 29.866667 6.4 6.4 14.933333 8.533333 23.466666 8.533333h8.533334l125.866666-32c6.4-2.133333 10.666667-4.266667 14.933334-8.533333l300.8-300.8c38.4-38.4 38.4-102.4 0-140.8-38.4-38.4-102.4-38.4-140.8 0L413.866667 469.333333c-4.266667 4.266667-6.4 8.533333-8.533334 14.933334z m59.733334 23.466666L761.6 213.333333c12.8-12.8 36.266667-12.8 49.066667 0 12.8 12.8 12.8 36.266667 0 49.066667L516.266667 558.933333l-66.133334 17.066667 14.933334-68.266667z"
                fill="#53b1e2"
                p-id="4223"></path>
            </svg>
          </div>
          <span>新对话</span>
        </RouterLink>
      </div>

      <div v-for="item in GlobalInformation.AllChatInfo" :key="item.uuid">
        <RouterLink :to="{ path: `/chat/${item.uuid}` }">
          <SliderItem :ChatInfo="item" @DeleteMsg="DeleteMsg" @ChangeTitle="ChangeTitle" />
        </RouterLink>
      </div>
    </el-scrollbar>
  </div>
</template>

<style scoped>
.maskplayActive {
  background-color: #e49fff;
}
</style>
